#pragma once

#include <glm/glm.hpp>

namespace findit {

constexpr float voxel_vertices[] = {
       // Передняя грань
    -0.5f, -0.5f,  0.5f, // Нижний левый
     0.5f, -0.5f,  0.5f, // Нижний правый
     0.5f,  0.5f,  0.5f, // Верхний правый
     0.5f,  0.5f,  0.5f, // Верхний правый
    -0.5f,  0.5f,  0.5f, // Верхний левый
    -0.5f, -0.5f,  0.5f, // Нижний левый

    // Задняя грань
    -0.5f, -0.5f, -0.5f, // Нижний левый
     0.5f, -0.5f, -0.5f, // Нижний правый
     0.5f,  0.5f, -0.5f, // Верхний правый
     0.5f,  0.5f, -0.5f, // Верхний правый
    -0.5f,  0.5f, -0.5f, // Верхний левый
    -0.5f, -0.5f, -0.5f, // Нижний левый

    // Левый бок
    -0.5f, -0.5f, -0.5f, // Нижний левый
    -0.5f, -0.5f,  0.5f, // Нижний правый
    -0.5f,  0.5f,  0.5f, // Верхний правый
    -0.5f,  0.5f,  0.5f, // Верхний правый
    -0.5f,  0.5f, -0.5f, // Верхний левый
    -0.5f, -0.5f, -0.5f, // Нижний левый

    // Правый бок
     0.5f, -0.5f, -0.5f, // Нижний левый
     0.5f, -0.5f,  0.5f, // Нижний правый
     0.5f,  0.5f,  0.5f, // Верхний правый
     0.5f,  0.5f,  0.5f, // Верхний правый
     0.5f,  0.5f, -0.5f, // Верхний левый
     0.5f, -0.5f, -0.5f, // Нижний левый

    // Верхняя грань
    -0.5f,  0.5f, -0.5f, // Левый верхний
     0.5f,  0.5f, -0.5f, // Правый верхний
     0.5f,  0.5f,  0.5f, // Правый верхний
     0.5f,  0.5f,  0.5f, // Правый верхний
    -0.5f,  0.5f,  0.5f, // Левый верхний
    -0.5f,  0.5f, -0.5f, // Левый верхний

    // Нижняя грань
    -0.5f, -0.5f, -0.5f, // Левый нижний
     0.5f, -0.5f, -0.5f, // Правый нижний
     0.5f, -0.5f,  0.5f, // Правый нижний
     0.5f, -0.5f,  0.5f, // Правый нижний
    -0.5f, -0.5f,  0.5f, // Левый нижний
    -0.5f, -0.5f, -0.5f  // Левый нижний
};

struct Voxel {
    glm::vec3 position;
    glm::vec3 color;
    bool visible = true;
};

}
